TEST2/meshConvergenceStudy/cases/coarse/constant/laserProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      laserProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Accepted keys for femtosecondLaserModel:
//   peakIntensity       [W/m^2]
//   pulseWidth          [s]
//   wavelength          [m]
//   absorptionCoeff     [1/m]
//   spotSize            [m]
//   pulseEnergy         [J]
//   direction           (vector)
//   focus               (point)
//   scanVelocity        (vector, optional)
//   pulseFrequency      [1/s, optional]
//   pulseDutyCycle      [-, optional]
//   reflectivity        [-]
//   gaussianProfile     [bool]
//   continuousLaser     [bool]
//   pulseCenterTime     [s, optional]
//   gasAbsorptionCoeff  [1/m, optional, default 0]
// Parameter checks enforce pulseWidth 10fs–10ps, wavelength 100nm–2µm
// and peakIntensity ≤6e16 W/m^2.
// Gaussian pulse focused in the 71.4 nm donor film (y=20.0000–20.0714 µm)
// Domain: x∈[0,50e-6], y∈[0,32.0714e-6], z∈[0,10e-6]
// LASER TIMING - shorter pulse, longer observation
laserStartTime      0;
laserEndTime    2e-10;
// CORRECTED: Specify exact film thickness to match blockMeshDict geometry
filmThicknessExpected    71.4e-9;    // 71.4 nm (matches y3 - y2 = 20.0714 - 20.0000)
filmCenterY              20.0357e-6;    // center at focus.y

// geometry coupling
gasAbsorptionCoeff 0;     // [1/m] gas absorption (0 disables direct gas heating)

// --- Energy & timing ---
// CRITICAL: Keep pulse energy compatible with interface heat-flux limit
// 60 nJ corresponds to the ~0.2 J/cm^2 fs-LIFT threshold reported by Piqué et al., Appl. Phys. A 79 (2004).
// NOTE: Omit pulseCenterTime to fire the single pulse immediately after
//       laserStartTime.  Supplying a later center delays deposition.
pulseEnergy              6e-8;      // 60 nJ (measured threshold fluence for Ti donor films)
pulseWidth               200e-15;   // 200 fs FWHM
wavelength               343e-9;    // 343 nm (Ti absorption peak)

// --- Spatial Gaussian (match the box center and film depth) ---
spotSize        6.0e-6;       // [m] beam diameter (3 μm 1/e² radius)
// Put the beam center inside the domain (mid x,z; inside donor film at y≈20.0357 μm)
focus            (25e-6 20.0357e-6 5e-6);
direction       (0 -1 0);

// Fresnel + absorption calculated internally
// Ti optical constants at 343 nm (Palik, Handbook of Optical Constants Vol. 1): //n ≈ 2.0-2.2, k ≈ 2.8 //α = 4πk/λ = 4π(2.8)/(343e-9) ≈ 1.03e8 m⁻¹
absorptionCoeff          1.03e8;    // 1/m (Ti at 343 nm, validated against Palik) Gives ~9.7 nm penetration depth (δ = 1/α)

// Reflectivity / profile
reflectivity        0.35;

temporalShape       gaussian;
spatialShape        gaussian;

gaussianProfile     true;

// Optional intensity entry (consistent with pulseEnergy & pulseWidth)
continuousLaser     false;
maxVolumetricSource 7e24;  // [W/m³] keep above the 0.2 J/cm^2, 200 fs Ti peak (~9e23 W/m³; Piqué et al., Appl. Phys. A 79, 2004)

// Repeating pulse train aligned with controlDict laser window
pulseFrequency      0;  // [1/s] 10 ps spacing so multiple pulses fire in 0–200 ps window
pulseDutyCycle      0;   // [-] 1 ps gate comfortably covers the 200 fs width each period
// Energy tolerance for validation
pulseEnergyToleranceRel 0.05; // 5% relative tolerance
pulseEnergyToleranceAbs 5e-10; // 1 nJ absolute tolerance

// NOTE: If peakIntensity is specified, it must match the derived value within 5% or
// the solver now aborts, so omit it to accept the computed value when iterating setups.
// ************************************************************************* //
